aDv4nSSer/comedero-iot-esp32/src/main_wokwi.cpp
/*
 * ═══════════════════════════════════════════════════════════════════════
 * COMEDERO INTELIGENTE IoT — v4.1-SIM (Simulación Wokwi)
 * ═══════════════════════════════════════════════════════════════════════
 * Versión adaptada para Wokwi VS Code. Cambios vs hardware real:
 *
 *   BLE      → comandos Serial (Serial Monitor de Wokwi)
 *   OTA      → animación visual de 5 segundos con millis()
 *   Vibrador → pin definido pero sin efecto visual en Wokwi
 *   Buzzer   → tone() funciona nativamente en Wokwi
 *
 * COMANDOS SERIAL (escribir en Serial Monitor):
 *   CONFIG:nombre,peso_kg,factor_rer   → configura perfil del perro
 *   ALIMENTO:marca,kcal_g              → configura alimento
 *   DISPENSAR                          → dispensación manual
 *   PLATILLO                           → simula +80g en platillo
 *   OTA                                → simula actualización firmware
 *   BOVEDA                             → fuerza detección de atasco
 *   STATUS                             → muestra telemetría completa
 *
 * SECUENCIA DE DEMO v4.1 (presentación):
 *   1. Arranque → bienvenida → REPOSO
 *   2. "STATUS"               → ver telemetría en Serial
 *   3. "CONFIG:Rex,20.0,130.0"→ cambiar perfil en vivo
 *   4. "DISPENSAR"            → servo gira 90° + LCD dispensando
 *   5. Bajar slider HX711     → peso del tanque baja
 *   6. "PLATILLO"             → simula +80g en platillo mascota
 *   7. Sistema verifica       → LCD "DISPENSACION OK" o "NO VERIF"
 *   8. "BOVEDA"               → error + buzzer + NeoPixel rojo
 *   9. Esperar 10s            → auto-reset a REPOSO
 *  10. "OTA"                  → barra azul 5s → verde → "v4.1"
 * ═══════════════════════════════════════════════════════════════════════
 */

#include <WiFi.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <HX711.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <Adafruit_NeoPixel.h>
#include <ESP32Servo.h>
#include <time.h>
#include <math.h>

// ─────────────────────────────────────────────────────────────────────
// WIFI WOKWI
// ─────────────────────────────────────────────────────────────────────
const char* WIFI_SSID = "Wokwi-GUEST";
const char* WIFI_PASS = "";

// ─────────────────────────────────────────────────────────────────────
// MQTT Y NTP
// ─────────────────────────────────────────────────────────────────────
const char* MQTT_BROKER = "broker.hivemq.com";
const int   MQTT_PORT   = 1883;
const char* TOPIC_TELEM   = "comedero/telemetria";
const char* TOPIC_CMD     = "comedero/comando";
const char* TOPIC_ALERTAS = "comedero/alertas";
const char* TOPIC_DISPENS = "comedero/dispensaciones";
const char* TOPIC_OTA_EVT = "comedero/ota";
const char* TOPIC_PERFIL  = "comedero/perfil";
const char* NTP_SERVER   = "pool.ntp.org";
const long  GMT_OFFSET   = -3 * 3600;
const int   DAYLIGHT_SEC = 0;

// ─────────────────────────────────────────────────────────────────────
// PINES v4.1 (idénticos al hardware real)
// ─────────────────────────────────────────────────────────────────────
#define PIN_HX711_DT    16
#define PIN_HX711_SCK   17
#define PIN_TRIG         5
#define PIN_ECHO        18
#define PIN_SERVO       13
#define PIN_BUZZER      32
#define PIN_VIBRADOR    33   // definido para compatibilidad; sin efecto visual en Wokwi
#define PIN_HX711_DT2   14
#define PIN_HX711_SCK2  15
#define PIN_NEOPIXEL    19
#define PIN_SDA         21
#define PIN_SCL         22

#define NUM_PIXELS  12
#define BRILLO      80

// ─────────────────────────────────────────────────────────────────────
// CONSTANTES
// ─────────────────────────────────────────────────────────────────────
const float CAPACIDAD_TANQUE_G   = 1000.0f;
const float DIST_VACIO_CM        =   20.0f;
const float UMBRAL_BOVEDA_PCT    =    0.30f;
const float ALPHA_EMA            =    0.30f;
const float UMBRAL_VERIF_PCT     =    0.50f;  // 50% para Wokwi (slider impreciso)
const unsigned long TIMEOUT_MOTOR_MS    = 30000;
const unsigned long OTA_SIM_DURACION_MS = 5000;

// ─────────────────────────────────────────────────────────────────────
// FSM
// ─────────────────────────────────────────────────────────────────────
enum Estado { REPOSO, DISPENSANDO, ERROR, ACTUALIZANDO_OTA };
Estado estadoActual = REPOSO;

enum DemoFase {
    DFASE_REPOSO, DFASE_BLE_PERFIL, DFASE_BLE_ALIMENTO,
    DFASE_DISPENSANDO, DFASE_VERIFICACION, DFASE_BOVEDA, DFASE_OTA
};
DemoFase demoFase = DFASE_REPOSO;

// ─────────────────────────────────────────────────────────────────────
// OBJETOS DE HARDWARE
// ─────────────────────────────────────────────────────────────────────
WiFiClient        espClient;
PubSubClient      mqtt(espClient);
Servo             compuerta;
HX711             balanza;
HX711             balanza2;
LiquidCrystal_I2C lcd(0x27, 20, 4);
Adafruit_NeoPixel anillo(NUM_PIXELS, PIN_NEOPIXEL, NEO_GRB + NEO_KHZ800);

// ─────────────────────────────────────────────────────────────────────
// PERFIL DEMO hardcodeado (en hardware real llega por BLE)
// ─────────────────────────────────────────────────────────────────────
struct PerfilDispensador {
    char  nombre_perro[32]   = "Demo";
    float peso_kg            = 15.0f;
    float factor_rer         = 130.0f;
    char  marca_alimento[32] = "RoyalCanin";
    float kcal_por_gramo     = 3.8f;
    int   horarios[4]        = {8, 13, 19, -1};
    int   num_horarios       = 3;
    bool  configurado        = true;
};

PerfilDispensador perfil;

// ─────────────────────────────────────────────────────────────────────
// VARIABLES OPERATIVAS
// ─────────────────────────────────────────────────────────────────────
float         masaObjetivoG        = 0.0f;
float         masaInicialG         = 0.0f;
float         consumoEMA           = 50.0f;
float         masaUltimaLectura    = 0.0f;
float         masaPlatilloAntes    = 0.0f;
float         masaPlatilloActual   = 0.0f;
float         distanciaUltima      = 0.0f;
String        estadoVerificacion   = "PENDIENTE";
int           ultimaHoraDispensada = -1;
unsigned long ultimoEnvioTelem     = 0;
unsigned long inicioDispensacion   = 0;
unsigned long ultimaActualizLCD    = 0;
unsigned long ultimaAnimacion      = 0;
unsigned long ultimaAlerta         = 0;
int           pixelAnimado         = 0;

// Variables exclusivas de simulación
bool          forzarBoveda  = false;
unsigned long otaSimInicio  = 0;
unsigned long demoInicio    = 0;
String        serialBuffer  = "";

// ─────────────────────────────────────────────────────────────────────
// FORWARD DECLARATIONS
// ─────────────────────────────────────────────────────────────────────
void  lcdMostrarOTA();
void  lcdMostrarError(const String& motivo);
void  lcdMostrarReposo();
void  lcdMostrarDispensando();
void  lcdMostrarBienvenida();
void  lcdMostrarVerificacion();
void  neoColorSolido(uint8_t r, uint8_t g, uint8_t b);
void  neoApagar();
void  neoNivelInventario(float masa);
void  neoGirar(uint8_t r, uint8_t g, uint8_t b);
void  neoParpadeoRojo();
void  abrirCompuerta();
void  cerrarCompuerta();
void  alertaAtasco();
void  publicarTelemetria(const String& alerta = "");
void  publicarAlerta(const String& tipoAlerta);
void  publicarDispensacion(float dispensado, const String& verif);
void  publicarOTA(const String& otaEstado);
void  publicarPerfil();
float leerMasaG();
float leerMasaPlatilloG();
float calcularRacion(float porcentajeHorario = 1.0f);
void  conectarMQTT();
void  imprimirStatus();
void  iniciarDispensacion();

