aDv4nSSer/comedero-iot-esp32/src/main_wokwi.cpp
void leerComandoSerial() {
    while (Serial.available()) {
        char c = (char)Serial.read();
        if (c == '\n' || c == '\r') {
            serialBuffer.trim();
            if (serialBuffer.length() > 0) {
                procesarComandoSerial(serialBuffer);
                serialBuffer = "";
            }
        } else if (c >= 32) {
            serialBuffer += c;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════
// NEOPIXEL (idéntico al hardware real)
// ═══════════════════════════════════════════════════════════════════════

void neoApagar() { anillo.clear(); anillo.show(); }

void neoColorSolido(uint8_t r, uint8_t g, uint8_t b) {
    for (int i = 0; i < NUM_PIXELS; i++)
        anillo.setPixelColor(i, anillo.Color(r, g, b));
    anillo.show();
}

void neoNivelInventario(float masa) {
    int activos = (int)((masa / CAPACIDAD_TANQUE_G) * NUM_PIXELS);
    anillo.clear();
    for (int i = 0; i < activos && i < NUM_PIXELS; i++) {
        if      (i < NUM_PIXELS / 3)        anillo.setPixelColor(i, anillo.Color(150, 0,   0));
        else if (i < (2 * NUM_PIXELS) / 3)  anillo.setPixelColor(i, anillo.Color(150, 100, 0));
        else                                 anillo.setPixelColor(i, anillo.Color(0,   150, 0));
    }
    anillo.show();
}

void neoGirar(uint8_t r, uint8_t g, uint8_t b) {
    anillo.clear();
    anillo.setPixelColor(pixelAnimado, anillo.Color(r, g, b));
    anillo.setPixelColor((pixelAnimado + 1) % NUM_PIXELS, anillo.Color(r/3, g/3, b/3));
    anillo.show();
    pixelAnimado = (pixelAnimado + 1) % NUM_PIXELS;
}

void neoParpadeoRojo() {
    static bool enc = false;
    enc = !enc;
    if (enc) neoColorSolido(200, 0, 0);
    else     neoApagar();
}

// ═══════════════════════════════════════════════════════════════════════
// LCD (idéntico al hardware real con indicador [SIM])
// ═══════════════════════════════════════════════════════════════════════

void lcdMostrarBienvenida() {
    lcd.clear();
    lcd.setCursor(1, 0); lcd.print("Comedero IoT v4.1");
    lcd.setCursor(0, 1); lcd.print("Simulacion Wokwi");
    lcd.setCursor(0, 2); lcd.print("Servo+Buzzer+Plato");
    lcd.setCursor(4, 3); lcd.print("Iniciando...");
}

void lcdMostrarReposo() {
    lcd.clear();
    struct tm t;
    char fila0[21];
    if (getLocalTime(&t)) {
        snprintf(fila0, sizeof(fila0), "REPOSO[SIM]  %02d:%02d", t.tm_hour, t.tm_min);
    } else {
        snprintf(fila0, sizeof(fila0), "REPOSO[SIM]  --:--");
    }
    lcd.setCursor(0, 0); lcd.print(fila0);
    char fila1[21];
    snprintf(fila1, sizeof(fila1), "%-7s%4.0fkg%4.0fg",
             perfil.nombre_perro, perfil.peso_kg, masaUltimaLectura);
    lcd.setCursor(0, 1); lcd.print(fila1);
    char fila2[21];
    snprintf(fila2, sizeof(fila2), "%-10s%.1fk/g",
             perfil.marca_alimento, perfil.kcal_por_gramo);
    lcd.setCursor(0, 2); lcd.print(fila2);
    float dias = (consumoEMA > 0.1f) ? (masaUltimaLectura / consumoEMA) : 999.0f;
    int   nH   = max(perfil.num_horarios, 1);
    char  fila3[21];
    snprintf(fila3, sizeof(fila3), "Dias:%4.1f R:%4.0fg",
             (dias > 99.9f ? 99.9f : dias), calcularRacion(1.0f / nH));
    lcd.setCursor(0, 3); lcd.print(fila3);
}

void lcdMostrarDispensando() {
    lcd.clear();
    lcd.setCursor(2, 0); lcd.print("> DISPENSANDO <");
    char buf[21];
    snprintf(buf, sizeof(buf), "Obj:%4.0fg Plat:%4.0fg",
             masaObjetivoG, masaPlatilloActual);
    lcd.setCursor(0, 1); lcd.print(buf);
    float dispensado = masaInicialG - masaUltimaLectura;
    if (dispensado < 0.0f) dispensado = 0.0f;
    float restante = masaObjetivoG - dispensado;
    if (restante < 0.0f) restante = 0.0f;
    snprintf(buf, sizeof(buf), "Dispensado: %5.1fg", dispensado);
    lcd.setCursor(0, 2); lcd.print(buf);
    snprintf(buf, sizeof(buf), "Restante:   %5.1fg", restante);
    lcd.setCursor(0, 3); lcd.print(buf);
}

void lcdMostrarVerificacion() {
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print(">> Verificacion <<  ");
    float recibido = masaPlatilloActual - masaPlatilloAntes;
    if (recibido < 0.0f) recibido = 0.0f;
    if (estadoVerificacion == "OK") {
        lcd.setCursor(0, 1); lcd.print("DISPENSACION OK!    ");
        lcd.setCursor(0, 2); lcd.print("Alimento verificado ");
    } else {
        lcd.setCursor(0, 1); lcd.print("NO VERIFICADA       ");
        lcd.setCursor(0, 2); lcd.print("Posible atasco tubo ");
    }
    char buf[21];
    snprintf(buf, sizeof(buf), "Platillo: %6.1fg", recibido);
    lcd.setCursor(0, 3); lcd.print(buf);
}

void lcdMostrarError(const String& motivo) {
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("!! ERROR CRITICO !!");
    lcd.setCursor(0, 1); lcd.print(motivo.substring(0, 20));
    lcd.setCursor(0, 2); lcd.print("Compuerta cerrada");
    lcd.setCursor(0, 3); lcd.print("Recuperando en 10s.");
}

void lcdMostrarOTA() {
    lcd.clear();
    lcd.setCursor(1, 0); lcd.print("** ACTUALIZANDO **");
    lcd.setCursor(2, 1); lcd.print("Firmware v4.1");
    lcd.setCursor(0, 2); lcd.print("Progreso:   0%");
    lcd.setCursor(0, 3); lcd.print("Simulacion Wokwi");
}

// ═══════════════════════════════════════════════════════════════════════
// SERVO (idéntico al hardware real — Wokwi tiene componente wokwi-servo)
// ═══════════════════════════════════════════════════════════════════════

void abrirCompuerta() {
    compuerta.write(90);
    Serial.println("[SERVO] Compuerta abierta (90°)");
}

void cerrarCompuerta() {
    compuerta.write(0);
}

// ═══════════════════════════════════════════════════════════════════════
// BUZZER + VIBRADOR
//
// Buzzer:   tone() funciona en Wokwi con el componente wokwi-buzzer
// Vibrador: pin definido, digitalWrite funciona, pero Wokwi no tiene
//           componente visual de vibrador. El código es el mismo para
//           mantener paridad con el hardware real.
// ═══════════════════════════════════════════════════════════════════════
void alertaAtasco() {
    Serial.println("[ALERTA] Activando buzzer + vibrador (vibrador sin efecto visual en Wokwi)");
    for (int i = 0; i < 3; i++) {
        tone(PIN_BUZZER, 1000, 200);
        delay(400);
    }
    for (int i = 0; i < 3; i++) {
        digitalWrite(PIN_VIBRADOR, HIGH);
        delay(300);
        digitalWrite(PIN_VIBRADOR, LOW);
        delay(200);
    }
}

