aDv4nSSer/comedero-iot-esp32/src/main_wokwi.cpp
// ═══════════════════════════════════════════════════════════════════════
// SENSORES — FUSIÓN HX711 TANQUE + HC-SR04 + HX711b PLATILLO
// ═══════════════════════════════════════════════════════════════════════

float leerMasaG() {
    if (balanza.is_ready()) {
        float lectura = (float)balanza.read() / 20.0f;
        masaUltimaLectura = constrain(lectura, 0.0f, CAPACIDAD_TANQUE_G);
    }
    return masaUltimaLectura;
}

float leerMasaPlatilloG() {
    if (balanza2.is_ready()) {
        long raw = balanza2.read();
        float lectura = (float)raw / 20.0f;
        float leido = constrain(lectura, 0.0f, CAPACIDAD_TANQUE_G);
        // Guard > 0: protege el valor del comando PLATILLO cuando el slider esta en 0.
        // Si el slider sube, leido > 0 y sobreescribe correctamente.
        if (leido > 0.0f) {
            masaPlatilloActual = leido;
            static unsigned long ultimoDebugPlat = 0;
            if (millis() - ultimoDebugPlat > 1000) {
                ultimoDebugPlat = millis();
                Serial.printf("[HX711b] raw=%ld → %.1fg (platilloActual=%.1fg)\n",
                              raw, leido, masaPlatilloActual);
            }
        }
    }
    return masaPlatilloActual;
}

float leerDistanciaCm() {
    digitalWrite(PIN_TRIG, LOW);  delayMicroseconds(2);
    digitalWrite(PIN_TRIG, HIGH); delayMicroseconds(10);
    digitalWrite(PIN_TRIG, LOW);
    long dur = pulseIn(PIN_ECHO, HIGH, 30000);
    distanciaUltima = (dur == 0) ? 999.0f : (float)dur * 0.0343f / 2.0f;
    return distanciaUltima;
}

bool detectarEfectoBoveda() {
    if (forzarBoveda) {
        forzarBoveda = false;
        Serial.println("[SIM] Efecto boveda forzado por Serial");
        return true;
    }
    return (distanciaUltima > DIST_VACIO_CM) &&
           (masaUltimaLectura > CAPACIDAD_TANQUE_G * UMBRAL_BOVEDA_PCT);
}

// ═══════════════════════════════════════════════════════════════════════
// MQTT (idéntico al hardware real — Wokwi tiene internet real)
// ═══════════════════════════════════════════════════════════════════════

void publicarTelemetria(const String& alerta) {
    if (!mqtt.connected()) return;
    const char* etiquetas[]   = {"REPOSO", "DISPENSANDO", "ERROR", "OTA"};
    const char* dfaseLabels[] = {"REPOSO", "BLE_PERFIL", "BLE_ALIMENTO",
                                  "DISPENSANDO", "VERIFICACION", "BOVEDA", "OTA"};
    const char* tipo = (perfil.factor_rer <= 80.0f)  ? "Senior" :
                       (perfil.factor_rer <= 110.0f) ? "Adulto" : "Cachorro";

    float racionG  = calcularRacion(1.0f / max(perfil.num_horarios, 1));
    float rerKcal  = perfil.factor_rer * powf(perfil.peso_kg, 0.75f);
    float nivelPct = (masaUltimaLectura / CAPACIDAD_TANQUE_G) * 100.0f;
    float dias     = (consumoEMA > 0.1f) ? (masaUltimaLectura / consumoEMA) : 999.0f;

    JsonDocument doc;
    doc["v"]         = "4.1-sim";
    doc["estado"]    = etiquetas[(int)estadoActual];
    doc["demo_fase"] = dfaseLabels[(int)demoFase];

    JsonObject perro = doc["perro"].to<JsonObject>();
    perro["nombre"]     = perfil.nombre_perro;
    perro["peso_kg"]    = perfil.peso_kg;
    perro["factor_rer"] = perfil.factor_rer;
    perro["tipo"]       = tipo;

    JsonObject alim = doc["alimento"].to<JsonObject>();
    alim["marca"]  = perfil.marca_alimento;
    alim["kcal_g"] = perfil.kcal_por_gramo;

    JsonObject tanque = doc["tanque"].to<JsonObject>();
    tanque["masa_g"]       = masaUltimaLectura;
    tanque["distancia_cm"] = distanciaUltima;
    tanque["nivel_pct"]    = nivelPct;

    JsonObject platillo = doc["platillo"].to<JsonObject>();
    platillo["masa_g"]       = masaPlatilloActual;
    platillo["verificacion"] = estadoVerificacion.c_str();

    JsonObject nutricion = doc["nutricion"].to<JsonObject>();
    nutricion["racion_g"]      = racionG;
    nutricion["rer_kcal"]      = rerKcal;
    nutricion["dias_restantes"] = (dias > 999.0f ? 999.0f : dias);
    nutricion["consumo_ema_g"] = consumoEMA;

    JsonObject sistema = doc["sistema"].to<JsonObject>();
    sistema["ble"]      = "SIM";
    sistema["ota"]      = (estadoActual == ACTUALIZANDO_OTA) ? "ACTUALIZANDO" : "LISTO";
    sistema["mqtt"]     = "OK";
    sistema["uptime_s"] = (unsigned long)(millis() / 1000);

    doc["alerta"] = (alerta.length() > 0) ? alerta : "NINGUNA";

    char buf[1024];
    serializeJson(doc, buf);
    mqtt.publish(TOPIC_TELEM, buf);
}

void publicarAlerta(const String& tipoAlerta) {
    if (!mqtt.connected()) return;
    const char* etiquetas[] = {"REPOSO", "DISPENSANDO", "ERROR", "OTA"};
    JsonDocument doc;
    doc["alerta"]   = tipoAlerta;
    doc["estado"]   = etiquetas[(int)estadoActual];
    doc["masa_g"]   = masaUltimaLectura;
    doc["dist_cm"]  = distanciaUltima;
    doc["uptime_s"] = (unsigned long)(millis() / 1000);
    char buf[256];
    serializeJson(doc, buf);
    mqtt.publish(TOPIC_ALERTAS, buf);
    Serial.printf("[MQTT] Alerta → comedero/alertas: %s\n", tipoAlerta.c_str());
}

void publicarDispensacion(float dispensado, const String& verif) {
    if (!mqtt.connected()) return;
    JsonDocument doc;
    doc["perro"]        = perfil.nombre_perro;
    doc["dispensado_g"] = dispensado;
    doc["objetivo_g"]   = masaObjetivoG;
    doc["verificacion"] = verif;
    doc["platillo_g"]   = masaPlatilloActual;
    doc["rer_kcal"]     = perfil.factor_rer * powf(perfil.peso_kg, 0.75f);
    doc["uptime_s"]     = (unsigned long)(millis() / 1000);
    char buf[256];
    serializeJson(doc, buf);
    mqtt.publish(TOPIC_DISPENS, buf);
    Serial.printf("[MQTT] Dispensacion → comedero/dispensaciones: %.1fg %s\n",
                  dispensado, verif.c_str());
}

void publicarOTA(const String& otaEstado) {
    if (!mqtt.connected()) return;
    JsonDocument doc;
    doc["estado"]   = otaEstado;
    doc["version"]  = "4.1-sim";
    doc["uptime_s"] = (unsigned long)(millis() / 1000);
    char buf[128];
    serializeJson(doc, buf);
    mqtt.publish(TOPIC_OTA_EVT, buf);
    Serial.printf("[MQTT] OTA → comedero/ota: %s\n", otaEstado.c_str());
}

