aDv4nSSer/comedero-iot-esp32/src/main_wokwi.cpp
void publicarPerfil() {
    if (!mqtt.connected()) return;
    const char* tipo = (perfil.factor_rer <= 80.0f)  ? "Senior" :
                       (perfil.factor_rer <= 110.0f) ? "Adulto" : "Cachorro";
    JsonDocument doc;
    doc["nombre"]     = perfil.nombre_perro;
    doc["peso_kg"]    = perfil.peso_kg;
    doc["factor_rer"] = perfil.factor_rer;
    doc["tipo"]       = tipo;
    doc["alimento"]   = perfil.marca_alimento;
    doc["kcal_g"]     = perfil.kcal_por_gramo;
    doc["racion_g"]   = calcularRacion(1.0f / max(perfil.num_horarios, 1));
    doc["uptime_s"]   = (unsigned long)(millis() / 1000);
    char buf[256];
    serializeJson(doc, buf);
    mqtt.publish(TOPIC_PERFIL, buf);
    Serial.printf("[MQTT] Perfil → comedero/perfil: %s %.1fkg %s\n",
                  perfil.nombre_perro, perfil.peso_kg, tipo);
}

void onMensajeMQTT(char* topic, byte* payload, unsigned int length) {
    String msg;
    msg.reserve(length);
    for (unsigned int i = 0; i < length; i++) msg += (char)payload[i];
    Serial.println("[MQTT CMD] " + msg);
    JsonDocument doc;
    if (deserializeJson(doc, msg)) return;
    String tipo = doc["tipo"] | "";
    if (tipo == "dispensar_ahora" && estadoActual == REPOSO && perfil.configurado) {
        iniciarDispensacion();
    }
}

void conectarMQTT() {
    if (WiFi.status() != WL_CONNECTED) return;
    if (mqtt.connected()) return;
    char cid[32];
    snprintf(cid, sizeof(cid), "ESP32_WOKWI_%08X", (unsigned int)esp_random());
    mqtt.setServer(MQTT_BROKER, MQTT_PORT);
    mqtt.setCallback(onMensajeMQTT);
    if (mqtt.connect(cid)) {
        mqtt.subscribe(TOPIC_CMD);
        Serial.println("[MQTT] Conectado al broker");
    }
}

// ═══════════════════════════════════════════════════════════════════════
// HORARIO AUTOMÁTICO
// ═══════════════════════════════════════════════════════════════════════
bool esHoraDeDispensar() {
    if (!perfil.configurado || perfil.num_horarios == 0) return false;
    struct tm t;
    if (!getLocalTime(&t)) return false;
    if (t.tm_hour == ultimaHoraDispensada) return false;
    for (int i = 0; i < perfil.num_horarios; i++) {
        if (t.tm_hour == perfil.horarios[i] && t.tm_min == 0) {
            ultimaHoraDispensada = t.tm_hour;
            return true;
        }
    }
    return false;
}

// ═══════════════════════════════════════════════════════════════════════
// HELPER — INICIAR DISPENSACIÓN
// ═══════════════════════════════════════════════════════════════════════
void iniciarDispensacion() {
    int nH             = max(perfil.num_horarios, 1);
    masaObjetivoG      = calcularRacion(1.0f / nH);
    masaInicialG       = masaUltimaLectura;
    masaPlatilloAntes  = masaPlatilloActual;  // snapshot antes de abrir
    estadoVerificacion = "PENDIENTE";
    inicioDispensacion = millis();
    abrirCompuerta();
    estadoActual       = DISPENSANDO;
    Serial.printf("[FSM] Dispensacion: %.1fg | platillo base=%.1fg\n",
                  masaObjetivoG, masaPlatilloAntes);
    Serial.println("[SIM] Baja el slider HX711 del tanque, luego escribe 'PLATILLO'");
}

// ═══════════════════════════════════════════════════════════════════════
// FSM — MANEJADORES DE ESTADO
// ═══════════════════════════════════════════════════════════════════════

void handleReposo() {
    leerMasaG();
    leerDistanciaCm();

    if (detectarEfectoBoveda()) {
        Serial.println("[FSM] Efecto boveda → ERROR");
        alertaAtasco();
        demoFase = DFASE_BOVEDA;
        publicarAlerta("EFECTO_BOVEDA");
        publicarTelemetria("EFECTO_BOVEDA");
        lcdMostrarError("Atasco detectado");
        estadoActual = ERROR;
        return;
    }

    if (esHoraDeDispensar()) {
        Serial.println("[FSM] Horario → DISPENSANDO");
        iniciarDispensacion();
        return;
    }

    if (millis() - ultimaAnimacion > 500) {
        ultimaAnimacion = millis();
        neoNivelInventario(masaUltimaLectura);
    }
    if (millis() - ultimaActualizLCD > 2000) {
        ultimaActualizLCD = millis();
        lcdMostrarReposo();
    }
}

void handleDispensando() {
    leerMasaG();
    leerDistanciaCm();
    leerMasaPlatilloG();

    if (detectarEfectoBoveda()) {
        cerrarCompuerta();
        alertaAtasco();
        Serial.println("[FSM] Efecto boveda durante dispensacion → ERROR");
        demoFase = DFASE_BOVEDA;
        publicarAlerta("EFECTO_BOVEDA_CRITICO");
        publicarTelemetria("EFECTO_BOVEDA_CRITICO");
        lcdMostrarError("Atasco critico!");
        estadoActual = ERROR;
        return;
    }

    float dispensado = masaInicialG - masaUltimaLectura;
    if (dispensado < 0.0f) dispensado = 0.0f;

    if (dispensado >= masaObjetivoG) {
        cerrarCompuerta();
        actualizarEMA(dispensado);

        float recibido = masaPlatilloActual - masaPlatilloAntes;
        Serial.printf(">> Platillo antes: %.1fg ahora: %.1fg diff: %.1fg (umbral: %.1fg)\n",
                      masaPlatilloAntes, masaPlatilloActual, recibido,
                      masaObjetivoG * UMBRAL_VERIF_PCT);
        if (recibido >= masaObjetivoG * UMBRAL_VERIF_PCT) {
            estadoVerificacion = "OK";
            Serial.printf("[FSM] Verificacion OK: platillo recibio %.1fg\n", recibido);
            demoFase = DFASE_VERIFICACION;
            publicarDispensacion(dispensado, estadoVerificacion);
            publicarTelemetria("DISPENSACION_OK");
        } else {
            estadoVerificacion = "NO_VERIFICADA";
            Serial.printf("[FSM] Verificacion FALLA: platillo %.1fg de %.1fg\n",
                          recibido > 0.0f ? recibido : 0.0f, masaObjetivoG);
            Serial.println("[SIM] Escribe 'PLATILLO' para simular que alimento llego al platillo");
            demoFase = DFASE_VERIFICACION;
            publicarDispensacion(dispensado, estadoVerificacion);
            publicarTelemetria("DISPENSACION_NO_VERIFICADA");
        }

        lcdMostrarVerificacion();
        delay(2000);
        estadoActual = REPOSO;
        return;
    }

    if (millis() - inicioDispensacion > TIMEOUT_MOTOR_MS) {
        cerrarCompuerta();
        Serial.println("[FSM] Timeout compuerta → ERROR");
        publicarTelemetria("TIMEOUT_SERVO");
        lcdMostrarError("Timeout compuerta");
        estadoActual = ERROR;
        return;
    }

    if (millis() - ultimaAnimacion > 80) {
        ultimaAnimacion = millis();
        neoGirar(0, 100, 200);
    }
    if (millis() - ultimaActualizLCD > 500) {
        ultimaActualizLCD = millis();
        lcdMostrarDispensando();
        Serial.printf("[DISP] tanque:%.1fg dispensado:%.1fg | platillo antes:%.1fg ahora:%.1fg\n",
                      masaUltimaLectura, dispensado, masaPlatilloAntes, masaPlatilloActual);
    }
}

void handleError() {
    cerrarCompuerta();

    if (millis() - ultimaAnimacion > 300) {
        ultimaAnimacion = millis();
        neoParpadeoRojo();
    }

    if (millis() - ultimaAlerta > 5000) {
        ultimaAlerta = millis();
        alertaAtasco();
    }

