aDv4nSSer/comedero-iot-esp32/src/main_wokwi.cpp
    static unsigned long tEntrada = 0;
    if (tEntrada == 0) tEntrada = millis();
    if (millis() - tEntrada > 10000) {
        tEntrada     = 0;
        ultimaAlerta = 0;
        estadoActual = REPOSO;
        neoApagar();
        lcd.clear();
        Serial.println("[FSM] Auto-recuperacion → REPOSO");
    }
}

// OTA simulado con millis() — barra de progreso azul 8 segundos
void handleActualizandoOTA() {
    if (otaSimInicio == 0) {
        otaSimInicio = millis();
        Serial.println("[SIM-OTA] Descargando firmware... (8 segundos)");
    }

    unsigned long elapsed = millis() - otaSimInicio;
    int pct = (int)min((elapsed * 100UL) / 8000UL, 100UL);

    int ledsActivos = (pct * NUM_PIXELS) / 100;
    anillo.clear();
    for (int i = 0; i < ledsActivos && i < NUM_PIXELS; i++)
        anillo.setPixelColor(i, anillo.Color(0, 0, 200));
    anillo.show();

    static unsigned long ultimoOtaLCD = 0;
    if (millis() - ultimoOtaLCD > 250) {
        ultimoOtaLCD = millis();
        lcd.setCursor(0, 2);
        char buf[21];
        snprintf(buf, sizeof(buf), "Progreso: %3d%%      ", pct);
        lcd.print(buf);
        Serial.printf("[SIM-OTA] %d%%\r", pct);
    }

    if (pct >= 100) {
        Serial.println("\n[SIM-OTA] Actualizacion completada! → v4.2");
        publicarOTA("COMPLETADO");
        publicarTelemetria("OTA_COMPLETADO");
        neoColorSolido(0, 200, 0);
        lcd.clear();
        lcd.setCursor(0, 0); lcd.print("  OTA completado!  ");
        lcd.setCursor(0, 1); lcd.print("  Firmware v4.2    ");
        lcd.setCursor(0, 2); lcd.print("  (simulacion)     ");
        lcd.setCursor(0, 3); lcd.print("  Volviendo...     ");
        delay(2000);
        otaSimInicio = 0;
        demoFase     = DFASE_REPOSO;
        estadoActual = REPOSO;
        lcd.clear();
        neoApagar();
    }
}

// ═══════════════════════════════════════════════════════════════════════
// DEMO AUTOMÁTICA — ciclo 95s para presentación
// ═══════════════════════════════════════════════════════════════════════
void ejecutarDemo() {
    if (demoInicio == 0) demoInicio = millis();
    unsigned long t = millis() - demoInicio;

    // FASE 1 — 10s: Simula BLE cambio perfil Senior
    if (t >= 10000 && t < 10100) {
        strncpy(perfil.nombre_perro, "Rex", 31);
        perfil.peso_kg    = 18.0;
        perfil.factor_rer = 70.0;
        perfil.configurado = true;
        demoFase = DFASE_BLE_PERFIL;
        Serial.println(">>> [BLE] Perfil: Rex Senior 18kg factor=70");
        publicarPerfil();
    }

    // FASE 2 — 20s: Simula BLE cambio alimento
    if (t >= 20000 && t < 20100) {
        strncpy(perfil.marca_alimento, "Hills Senior", 31);
        perfil.kcal_por_gramo = 3.2;
        demoFase = DFASE_BLE_ALIMENTO;
        Serial.println(">>> [BLE] Alimento: Hills Senior 3.2kcal/g");
        publicarPerfil();
    }

    // FASE 3 — 30s: Auto dispensar
    if (t >= 30000 && t < 30100) {
        if (estadoActual == REPOSO && perfil.configurado) {
            demoFase = DFASE_DISPENSANDO;
            Serial.println(">>> [AUTO] Dispensacion iniciada por horario");
            iniciarDispensacion();
        }
    }

    // FASE 4 — 30-50s: Bajar masa tanque gradualmente (3g/800ms → ~15s para 56g)
    // Con Rex 18kg Hills Senior: racion=56.2g, a 3g/800ms completa en ~15s (t≈45s)
    if (t >= 30000 && t < 50000 && estadoActual == DISPENSANDO) {
        static unsigned long ultimaBajada = 0;
        if (millis() - ultimaBajada > 800) {
            ultimaBajada = millis();
            masaUltimaLectura = max(0.0f, masaUltimaLectura - 3.0f);
        }
    }

    // FASE 5 — 40s: Platillo recibe alimento ANTES de que termine la dispensacion (~t=45s)
    // Garantiza que masaPlatilloActual > 0 cuando se evalua la verificacion
    if (t >= 40000 && t < 40100) {
        masaPlatilloActual += 85.0;
        demoFase = DFASE_VERIFICACION;
        Serial.printf(">>> [SENSOR] Platillo: +85g → total=%.1fg (antes=%.1fg)\n",
                      masaPlatilloActual, masaPlatilloAntes);
    }

    // FASE 6 — 65s: Efecto Boveda (fusion sensorial)
    if (t >= 65000 && t < 65100) {
        if (estadoActual == REPOSO) {
            distanciaUltima   = 25.0;
            masaUltimaLectura = 400.0;
            demoFase = DFASE_BOVEDA;
            Serial.println(">>> [FUSION] HC-SR04=25cm + HX711=400g = BOVEDA!");
        }
    }

    // FASE 7 — 80s: Simula OTA
    if (t >= 80000 && t < 80100) {
        if (estadoActual == REPOSO || estadoActual == ERROR) {
            demoFase     = DFASE_OTA;
            Serial.println(">>> [OTA] Nueva version disponible, actualizando...");
            estadoActual = ACTUALIZANDO_OTA;
            otaSimInicio = millis();
            publicarOTA("INICIANDO");
            publicarTelemetria("OTA_INICIADO");
            lcdMostrarOTA();
        }
    }

    // FASE 8 — 95s: Reset y nuevo ciclo
    if (t >= 95000) {
        demoInicio         = millis();
        masaUltimaLectura  = 750.0;
        masaPlatilloActual = 0.0;
        distanciaUltima    = 5.0;
        demoFase           = DFASE_REPOSO;
        estadoActual       = REPOSO;
        lcd.clear();
        Serial.println(">>> [DEMO] Ciclo completo - reiniciando en 3s");
        delay(3000);
    }
}

// ═══════════════════════════════════════════════════════════════════════
// SETUP
// ═══════════════════════════════════════════════════════════════════════
void setup() {
    Serial.begin(115200);
    delay(500);
    Serial.println(F("\n╔════════════════════════════╗"));
    Serial.println(F("║  Comedero IoT v4.1-SIM     ║"));
    Serial.println(F("║  Servo + Buzzer + Platillo  ║"));
    Serial.println(F("╚════════════════════════════╝"));
    Serial.println(F("\nComandos Serial:"));
    Serial.println(F("  CONFIG:n,p,f | ALIMENTO:m,k"));
    Serial.println(F("  DISPENSAR    | PLATILLO"));
    Serial.println(F("  OTA          | BOVEDA | STATUS\n"));

    // ── Pines ─────────────────────────────────────────────────────────
    pinMode(PIN_TRIG,     OUTPUT);
    pinMode(PIN_ECHO,     INPUT);
    pinMode(PIN_BUZZER,   OUTPUT);
    pinMode(PIN_VIBRADOR, OUTPUT);  // definido aunque Wokwi no lo renderiza

    // ── Servo compuerta ───────────────────────────────────────────────
    compuerta.setPeriodHertz(50);
    compuerta.attach(PIN_SERVO, 500, 2400);
    cerrarCompuerta();

