aDv4nSSer/comedero-iot-esp32/src/main_wokwi.cpp
    // ── LCD I2C ───────────────────────────────────────────────────────
    Wire.begin(PIN_SDA, PIN_SCL);
    lcd.init();
    lcd.backlight();
    lcdMostrarBienvenida();

    // ── NeoPixel ──────────────────────────────────────────────────────
    anillo.begin();
    anillo.setBrightness(BRILLO);
    neoColorSolido(0, 50, 0);
    delay(800);

    // ── HX711 tanque + HX711b platillo ───────────────────────────────
    balanza.begin(PIN_HX711_DT, PIN_HX711_SCK);
    balanza2.begin(PIN_HX711_DT2, PIN_HX711_SCK2);

    Serial.printf("[SIM] Perfil demo: %s %.1fkg | %s %.2fkcal/g\n",
                  perfil.nombre_perro, perfil.peso_kg,
                  perfil.marca_alimento, perfil.kcal_por_gramo);

    // ── WiFi Wokwi-GUEST ──────────────────────────────────────────────
    Serial.print("[WiFi] Conectando a Wokwi-GUEST");
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    int intentos = 0;
    while (WiFi.status() != WL_CONNECTED && intentos < 40) {
        delay(500); Serial.print("."); intentos++;
    }
    if (WiFi.status() == WL_CONNECTED) {
        Serial.printf("\n[WiFi] Conectado — IP: %s\n", WiFi.localIP().toString().c_str());
        configTime(GMT_OFFSET, DAYLIGHT_SEC, NTP_SERVER);
        delay(2000);
        conectarMQTT();
    } else {
        Serial.println(F("\n[WiFi] Sin conexion"));
    }

    Serial.println(F("[SETUP] Sistema listo — escribe comandos en Serial Monitor\n"));
    lcd.clear();
}

// ═══════════════════════════════════════════════════════════════════════
// LOOP
// ═══════════════════════════════════════════════════════════════════════
void loop() {
    leerComandoSerial();

    if (!mqtt.connected()) conectarMQTT();
    mqtt.loop();

    ejecutarDemo();

    switch (estadoActual) {
        case REPOSO:           handleReposo();          break;
        case DISPENSANDO:      handleDispensando();     break;
        case ERROR:            handleError();           break;
        case ACTUALIZANDO_OTA: handleActualizandoOTA(); break;
    }

    if (millis() - ultimoEnvioTelem > 10000) {
        ultimoEnvioTelem = millis();
        publicarTelemetria();
    }

    delay(50);
}
